#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# 切片 slice

L = ['Michael', 'Sarah', 'Tracy', 'Bob', 'Jack']

L[0:3]
L[:3]

# ['Michael', 'Sarah', 'Tracy']
# ['Michael', 'Sarah', 'Tracy']

# L[0:3]表示，从索引0开始取，直到索引3为止，但不包括索引3。即索引0，1，2，正好是3个元素
# 第一个索引是0，可以省略
# L[-1]取倒数第一个元素，那么它同样支持倒数切片

L[-2:]
L[-2:-1]

# ['Bob', 'Jack']
# ['Bob']

# 倒数第一个元素的索引是-1

l = list(range(100))
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

l[10:20]
# 前11-20个数
# [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

l[:10]
# 前10个数
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

l[-10:]
# 后10个数
# [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

l[:10:2]
# 前10个数，每两个取一个
# [0, 2, 4, 6, 8]

l[::5]
# 所有数，每5个取一个
# [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

l[:]
# 只写[:]可以原样复制一个list
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

# tuple也是一种list，唯一区别是tuple不可变
# tuple用切片操作，结果仍是tuple
(0, 1, 2, 3, 4, 5)[:3]
# (0, 1, 2)

# 字符串'xxx'也可以看成是一种list，每个元素就是一个字符
# 字符串用切片操作，结果仍是字符串
'ABCDEFG'[:3]
# 'ABC'

'ABCDEFG'[::2]
# 'ACEG'


# 利用切片操作，实现一个trim()函数，去除字符串首尾的空格，注意不要调用str的strip()方法
def trim(s):
    start = 0
    end = len(s)

    while start < end and s[start] == ' ':
        start += 1

    while start < end and s[end - 1] == ' ':
        end -= 1

    return s[start:end]


# 🗿🗿🗿🗿🗿🗿🗿🗿🗿 
# 关于 range()
# range(n) 是一个用于生成从 0 到 n-1 的整数序列的函数。具体来说，range(n) 函数会生成一个包含从 0 到 n-1 的整数的可迭代对象（不包括 n）。
# 在很多情况下，range(n) 是用来控制循环次数的一个非常方便的方法

s = range(5)
print(s)
# range(0, 5)

# range() 函数创建的是一个序列，但它不是列表、元组或字典中的任何一种。它创建的是一个特殊的可迭代对象，用于表示一个整数序列。
# range() 函数返回的是一个 range 对象，它表示一个不可变的整数序列。这个对象的内容是一个由起始值、终止值和步长组成的序列，但它并不是一个列表、元组或字典。